<h2>3장 pandas</h2>

In [7]:
import pandas 
pandas.__version__

'2.2.2'

In [1]:
import pandas as pd

In [2]:
import numpy as np

<h3>pandas series 객체</h3>
인덱싱 된 1차원 배열로
리스트나 배열로부터 만들 수 있다.

In [25]:

data= pd.Series([0.25,0.5,0.75,1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [4]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [5]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
data[1]

0.5

In [7]:
data[1:3]

1    0.50
2    0.75
dtype: float64

In [27]:
"""series:일반화된 numpy 배열"""
data=pd.Series([0.205,0.5,0.75,1.0],index=['a','b','c','d'])
data

a    0.205
b    0.500
c    0.750
d    1.000
dtype: float64

In [30]:
data['b'],type(data),type(data.values), data.dtype

(0.5, pandas.core.series.Series, numpy.ndarray, dtype('float64'))

In [11]:
"""연속적이지 않은 인덱스"""
data=pd.Series([0.205,0.5,0.75,1.0],index=[2,3,5,7])
data

2    0.205
3    0.500
5    0.750
7    1.000
dtype: float64

In [12]:
"""Series :특수한 딕셔너리"""
population_dict = {
    'california' : 38332521,
    'florida' : 19552860
}

population=pd.Series(population_dict)
population

california    38332521
florida       19552860
dtype: int64

In [15]:
population['califonia':'florida']

california    38332521
florida       19552860
dtype: int64

In [16]:
"""series : 객체 구성하기"""
"""pd.Series(data, index=index)"""
pd.Series([2,4,6])

0    2
1    4
2    6
dtype: int64

In [17]:
pd.Series(5, index=[100,200,300])

100    5
200    5
300    5
dtype: int64

In [19]:
"""index는 딕셔너리 키를 정렬해서 취한다."""
pd.Series({2:'a' , 1: 'b', 3:'c'}, index=[3,2])

3    c
2    a
dtype: object

<h3>pandas dataframe 객체</h3>
유연한 행 인덱스와 유연한 열 이름을 가진 2차원 배열

In [33]:
area_dict = {'california'  :423967 , 'florida' : 695662}
area=pd.Series(area_dict)
area

california    423967
florida       695662
dtype: int64

In [43]:
states = pd.DataFrame({'population' : population , 'area' : area})
states, states.head(), states.columns, len(states)

(            population    area
 california    38332521  423967
 florida       19552860  695662,
             population    area
 california    38332521  423967
 florida       19552860  695662,
 Index(['population', 'area'], dtype='object'),
 2)

In [44]:
type(states), type(states['area'])

(pandas.core.frame.DataFrame, pandas.core.series.Series)

In [35]:
"""열"""
states.index

Index(['california', 'florida'], dtype='object')

In [37]:
"""열"""
states.columns

Index(['population', 'area'], dtype='object')

In [38]:
states['area']

california    423967
florida       695662
Name: area, dtype: int64

In [39]:
"""단일 series 객체에서 구성하기"""
pd.DataFrame(population, columns=['population'])

            population
california    38332521
florida       19552860

In [40]:
"""딕셔너리의 리스트에서 구성하기"""
data=[{'a':i, 'b':2*i} for i in range(3)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

In [42]:
pd.DataFrame([{'a':1, 'b':2}, {'b':3, 'c':4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

<h3>데이터 정보 잠시 보는 방법
    head()
info()
describe()</h3>

In [45]:
"""head() 앞쪽부터 5개 , tail() 끝에서부터"""
df = pd.read_csv('data/president_heights.csv')
df.head()

   order               name  height(cm)
0      1  George Washington         189
1      2         John Adams         170
2      3   Thomas Jefferson         189
3      4      James Madison         163
4      5       James Monroe         183

In [50]:
df['height(cm)'] , type(df['height(cm)']), df['height(cm)'].dtype

(0     189
 1     170
 2     189
 3     163
 4     183
 5     171
 6     185
 7     168
 8     173
 9     183
 10    173
 11    173
 12    175
 13    178
 14    183
 15    193
 16    178
 17    173
 18    174
 19    183
 20    183
 21    168
 22    170
 23    178
 24    182
 25    180
 26    183
 27    178
 28    182
 29    188
 30    175
 31    179
 32    183
 33    193
 34    182
 35    183
 36    177
 37    185
 38    188
 39    188
 40    182
 41    185
 42    191
 43    182
 Name: height(cm), dtype: int64,
 pandas.core.series.Series,
 dtype('int64'))

In [51]:
np.average( df['height(cm)'])

180.04545454545453

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44 entries, 0 to 43
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   order       44 non-null     int64
 1   name        44 non-null     object
 2   height(cm)  44 non-null     int64
dtypes: int64(2), object(1)
memory usage: 1.2+ KB

In [53]:
df.describe()

           order  height(cm)
count  44.000000   44.000000
mean   23.522727  180.045455
std    13.729087    7.064337
min     1.000000  163.000000
25%    11.750000  174.750000
50%    24.000000  182.000000
75%    35.250000  183.500000
max    46.000000  193.000000

<h3>pandas index 객체</h3>

In [54]:
ind= pd.Index([2,3,5,7,11])
ind

Index([2, 3, 5, 7, 11], dtype='int64')

In [55]:
ind[1]

3

In [56]:
ind[::2]

Index([2, 5, 11], dtype='int64')

In [58]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int64

In [64]:
"""index객체와 numpy 배열의 한가지 차이점이라면 indexr는 일반적인 방법으로는 변경될 수 없는 불변의 값이라느 점이다."""
"""ind[1]=0"""

'ind[1]=0'

In [71]:
indA= pd.Index([1,3,5,7,9])
indB= pd.Index([2,3,5,7,11])

In [76]:
"""교집합"""
indA.intersection(indB)

Index([3, 5, 7], dtype='int64')

In [77]:
"""합집합"""
indA.union(indB)

Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [78]:
"""차집합"""
indA.difference(indB)

Index([1, 9], dtype='int64')

<h3>데이터 인덱싱과 선택</h3>

<h3>1)series 에서 데이터 선택</h3>

In [98]:
data=pd.Series([0.25,0.5], index=['a','b'])
data

a    0.25
b    0.50
dtype: float64

In [80]:
data['b']

0.5

In [81]:
'a' in data

True

In [83]:
data.keys()

Index(['a', 'b'], dtype='object')

In [84]:
list(data.items())

[('a', 0.25), ('b', 0.5)]

In [99]:
"""새로운 값 할당"""
data['c']=1.25
data

a    0.25
b    0.50
c    1.25
dtype: float64

In [86]:
data['a':'c']

a    0.25
b    0.50
c    1.25
dtype: float64

In [87]:
"""암묵적 인덱스일 경우 최종인덱스가 제외된다."""
data[:2]

a    0.25
b    0.50
dtype: float64

In [101]:
"""마스킹"""
test_mask= (data>0.3) & (data<0.8)
data[test_mask]

b    0.5
dtype: float64

In [89]:
"""팬시 인덱싱"""
data[['a','c']]

a    0.25
c    1.25
dtype: float64

In [90]:
"""loc와 iloc"""
data= pd.Series(['a','b','c'], index=[1,2,3])
data

1    a
2    b
3    c
dtype: object

In [91]:
"""명시적 인덱싱"""
data[1]

'a'

In [92]:
"""암묵적  인덱싱"""
data[0:2]

1    a
2    b
dtype: object

In [93]:
"""정수인덱스를 사용하는 경우 혼선이 발생할 수 있기 때문에 인덱스 방식을 명시적으로 드러내는 인덱서 속성 제공"""
"""loc, iloc"""
data.loc[1]

'a'

data.loc[1:3]

In [95]:
data.iloc[1]

'b'

In [96]:
data.iloc[1:3]

2    b
3    c
dtype: object

In [102]:
"""head() 앞쪽부터 5개 , tail() 끝에서부터"""
df = pd.read_csv('data/president_heights.csv')
df.head()

   order               name  height(cm)
0      1  George Washington         189
1      2         John Adams         170
2      3   Thomas Jefferson         189
3      4      James Madison         163
4      5       James Monroe         183

In [106]:
df.loc[1,'name':'height']

name          John Adams
height(cm)           170
Name: 1, dtype: object

In [107]:
df.iloc[1,1:3]

name          John Adams
height(cm)           170
Name: 1, dtype: object

<h3>2)dataframe에서 데이터 선택</h3>

In [129]:


df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [111]:
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [130]:
"""새로운 컬럼 만들기"""
df['survived_rate']=df['Survived']/1
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,survived_rate
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0.0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1.0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0.0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1.0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0.0

In [131]:
df.values, df.values.shape

(array([[1, 0, 3, ..., nan, 'S', 0.0],
        [2, 1, 1, ..., 'C85', 'C', 1.0],
        [3, 1, 3, ..., nan, 'S', 1.0],
        ...,
        [889, 0, 3, ..., nan, 'S', 0.0],
        [890, 1, 1, ..., 'C148', 'C', 1.0],
        [891, 0, 3, ..., nan, 'Q', 0.0]], dtype=object),
 (891, 13))

In [132]:
df_copy = df.values.T
df_copy, df_copy.shape

(array([[1, 2, 3, ..., 889, 890, 891],
        [0, 1, 1, ..., 0, 1, 0],
        [3, 1, 3, ..., 3, 1, 3],
        ...,
        [nan, 'C85', nan, ..., nan, 'C148', nan],
        ['S', 'C', 'S', ..., 'S', 'C', 'Q'],
        [0.0, 1.0, 1.0, ..., 0.0, 1.0, 0.0]], dtype=object),
 (13, 891))

In [117]:
df.iloc[:5,4:]

,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,survived_rate
0,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0.0
1,female,38.0,1,0,PC 17599,71.2833,C85,C,1.0
2,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1.0
3,female,35.0,1,0,113803,53.1000,C123,S,1.0
4,male,35.0,0,0,373450,8.0500,NaN,S,0.0

In [134]:
df.loc[:4,'Sex':'survived_rate'] , type(df.loc[:4,'Sex':'survived_rate'])

(      Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked  \
 0    male  22.0      1      0         A/5 21171   7.2500   NaN        S
 1  female  38.0      1      0          PC 17599  71.2833   C85        C
 2  female  26.0      0      0  STON/O2. 3101282   7.9250   NaN        S
 3  female  35.0      1      0            113803  53.1000  C123        S
 4    male  35.0      0      0            373450   8.0500   NaN        S

    survived_rate
 0            0.0
 1            1.0
 2            1.0
 3            1.0
 4            0.0  ,
 pandas.core.frame.DataFrame)

In [137]:
df.loc[df['Survived']==1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,survived_rate
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1.0
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S,1.0
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C,1.0
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C,1.0
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S,1.0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1.0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1.0

<h3>loc(조건),iloc(슬라이싱)의 리턴타입은 dataframe, series이다.pandas사용에 수월하다</h3>
<h3>values의 리턴타입은 array이다.numpy로 이용하기에 수월하다.</h3>

In [122]:
df.iloc[0,4]='female'
df.iloc[0,1]=0
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,survived_rate
0,1,0,3,"Braund, Mr. Owen Harris",female,22.0,1,0,A/5 21171,7.2500,NaN,S,0.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0.0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1.0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0.0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1.0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0.0

<h3> pandas에서 데이터 연산하기</h3>

In [123]:
rng=np.random.RandomState(42)
ser=pd.Series(rng.randint(0,10,4))
ser

0    6
1    3
2    7
3    4
dtype: int32

In [124]:
type(ser), type(ser.values), ser[0].dtype

(pandas.core.series.Series, numpy.ndarray, dtype('int32'))

In [125]:
df=pd.DataFrame(rng.randint(0,10,(3,4)), columns=['A','B','C','D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [126]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [127]:
np.sin(df*np.pi/4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

In [142]:
"""SERIES에서 인덱스 정렬"""
area=pd.Series({'Alaska':1723337, 'taxas':695662, 'california':423967}, name='area')
population=pd.Series({'taxas':26448193, 'california':38332521, 'newyork':19651127}, name='population')

In [143]:
population/area

Alaska              NaN
california    90.413926
newyork             NaN
taxas         38.018740
dtype: float64

In [146]:
area.index.union(  population.index)

Index(['Alaska', 'california', 'newyork', 'taxas'], dtype='object')

In [165]:
A=pd.Series([2,4,6],index=[0,1,2])
B=pd.Series([1,3,5],index=[1,2,3])

In [166]:
A

0    2
1    4
2    6
dtype: int64

In [167]:
B

1    1
2    3
3    5
dtype: int64

In [179]:
"pandas에서 인덱스가 중요하다"""
A+B

      A     B   C
0  19.0  20.0 NaN
1   8.0   3.0 NaN
2   NaN   NaN NaN

In [180]:
"""누락된 요소의 채우기 값을 선택해 명시적으로 지정"""
A.add(B, fill_value=0)

      A     B    C
0  19.0  20.0  7.0
1   8.0   3.0  3.0
2   7.0   1.0  3.0

In [170]:
"""dataframe에서 인덱스 정렬"""
A=pd.DataFrame(rng.randint(0,20,(2,2)), columns=list('AB'))
A

    A   B
0  13  17
1   8   1

In [171]:
B=pd.DataFrame(rng.randint(0,10,(3,3)), columns=list('BAC'))
B

   B  A  C
0  3  6  7
1  2  0  3
2  1  7  3

In [172]:
A+B

      A     B   C
0  19.0  20.0 NaN
1   8.0   3.0 NaN
2   NaN   NaN NaN

In [173]:
A.add(B, fill_value=0)

      A     B    C
0  19.0  20.0  7.0
1   8.0   3.0  3.0
2   7.0   1.0  3.0

In [175]:
fill=A.stack().mean()
A.add(B, fill_value=fill)

       A      B      C
0  19.00  20.00  16.75
1   8.00   3.00  12.75
2  16.75  10.75  12.75

In [158]:
A=rng.randint(10, size=(3,4))
A

array([[3, 8, 2, 4],
       [2, 6, 4, 8],
       [6, 1, 3, 8]])

In [159]:
A-A[0]

array([[ 0,  0,  0,  0],
       [-1, -2,  2,  4],
       [ 3, -7,  1,  4]])

In [161]:
df=pd.DataFrame(A, columns=list('QRST'))
df-df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -1 -2  2  4
2  3 -7  1  4

In [162]:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0 -5  0 -6 -4
1 -4  0 -2  2
2  5  0  2  7

<h3>누락된 데이터 처리하기</h3>

In [215]:
"""891이 최대값이라 하면 Age,  Cabin, Embarked는 891보다 작으므로 데이터가 누락되었을 것이다.=>np.nansum()과 같이 연산해야한다."""
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [181]:
vals1=np.array([1,None, 2, 3])
vals1

array([1, None, 2, 3], dtype=object)

In [182]:
"""none을 사용한 산술연산을 지원하지 않는다."""
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [196]:
"""nan:부동소수점표기 사용"""
vals2=np.array([1,np.nan, 2, 3])
vals2, vals2.dtype

(array([ 1., nan,  2.,  3.]), dtype('float64'))

In [184]:
1+np.nan

nan

In [185]:
0*np.nan

nan

In [186]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

In [187]:
"""nan을 무시하는 계산"""
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(6.0, 1.0, 3.0)

In [189]:
"""nan과 None의 호환성 처리"""
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [191]:
x=pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int32

In [192]:
x[0]=None
x

0    NaN
1    1.0
dtype: float64

In [193]:
pd.Series([1,np.nan , 2, None, pd.NA], dtype='Int32')

0       1
1    <NA>
2       2
3    <NA>
4    <NA>
dtype: Int32

In [197]:
"""널값 탐지"""
data=pd.Series([1, np.nan, 'hello', None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [198]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [200]:
"""널값 제거"""
data.dropna() , data.dropna().size

(0        1
 2    hello
 dtype: object,
 2)

In [202]:
"""dataframe에 index, columns 안 주면 기본적으로 0,1,2순서대로 나열"""
df = pd.DataFrame([[1,np.nan,2], [2,3,5],[np.nan, 4,6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [203]:
"""널 값 있는 행 제거"""
df.dropna()

     0    1  2
1  2.0  3.0  5

In [204]:
"""널 값 있는 열 제거"""
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [205]:
"""유호한 일부 데이터를 유지하기 위해, how=ant, all을 사용한다."""
df[3]=np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [206]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [209]:
df.dropna(axis='columns', how='any')

   2
0  2
1  5
2  6

In [208]:
"""널 아닌 값이 최소 3개 있어야 행 삭제 하지 않음"""
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [211]:
df.dropna(axis='columns', thresh=3)

   2
0  2
1  5
2  6

In [216]:
"""널값 채우기"""
data=pd.Series([1, np.nan, 'hello', None])
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [217]:
data.fillna(0)

0        1
1        0
2    hello
3        0
dtype: object

In [218]:
"""이전 값으로 채우기"""
data.fillna(method='ffill')

C:\Users\user\AppData\Local\Temp\ipykernel_9040\1844443866.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method='ffill')

0        1
1        1
2    hello
3    hello
dtype: object

In [219]:

data=pd.Series([1, np.nan, 'hello', None,2])
data

0        1
1      NaN
2    hello
3     None
4        2
dtype: object

In [220]:
"""다음에 오는 값으로 채우기"""
data.fillna(method='bfill')

C:\Users\user\AppData\Local\Temp\ipykernel_9040\1397359497.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method='bfill')

0        1
1    hello
2    hello
3        2
4        2
dtype: object

<h3>타이타닉 csv 누락 데이터 채우기</h3>

In [221]:
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [233]:
df_copy =df.copy()
df_copy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [236]:
"""null값이 있는 행을 삭제하면 유효한 값까지 삭제되어 행 개수가 891에서 183이 된다."""

df_drop=df_copy.dropna()
df_drop

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [244]:
aver=np.sum(df_drop['Age'])//183
aver

35.0

In [247]:
df_copy.fillna(aver)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,35.0,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,35.0,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,35.0,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,35.0,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,35.0,1,2,W./C. 6607,23.4500,35.0,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,35.0,Q

In [248]:
df_copy.fillna(np.sum(df_copy.dropna()['Age'])//183)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,35.0,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,35.0,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,35.0,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,35.0,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,35.0,1,2,W./C. 6607,23.4500,35.0,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,35.0,Q

<h2>계층적 인덱싱 145쪽</h2>

In [1]:
import pandas as pd
import numpy as np

In [2]:
"""다중 인덱스 Series"""
idex=[('cali', 2000), ('cali', 2010), ('newyork',2000),('newyork', 2010)]
populations=[33871648,37253956,18976457,19378102]
pop=pd.Series(populations, index=idex)
pop

(cali, 2000)       33871648
(cali, 2010)       37253956
(newyork, 2000)    18976457
(newyork, 2010)    19378102
dtype: int64

In [4]:
pop[('cali', 2010):('newyork',2000)]

(cali, 2010)       37253956
(newyork, 2000)    18976457
dtype: int64

In [6]:
pop[[i for i in pop.index if i[1]==2010]]

(cali, 2010)       37253956
(newyork, 2010)    19378102
dtype: int64

In [37]:
"""더 나은 방식 :pandas Multiindex"""
"""MultiIndex.from_tuples은 튜플 (키,값)  하나하나를 다 인덱스로 쓴다."""
index= pd.MultiIndex.from_tuples(idex)
index

MultiIndex([(   'cali', 2000),
            (   'cali', 2010),
            ('newyork', 2000),
            ('newyork', 2010)],
           )

In [38]:
pop=pop.reindex(index)
pop

cali     2000    33871648
         2010    37253956
newyork  2000    18976457
         2010    19378102
dtype: int64

In [39]:
pop[:,2010]

cali       37253956
newyork    19378102
dtype: int64

In [40]:
"""MultiIndex 추가 차원"""
"""unstack()은 다중인덱스를 가진 Series를 전형적인 인덱스를 가진 DataFrame으로 변환함"""
pop_df=pop.unstack()
pop_df

             2000      2010
cali     33871648  37253956
newyork  18976457  19378102

In [14]:
pop_df.stack()

cali     2000    33871648
         2010    37253956
newyork  2000    18976457
         2010    19378102
dtype: int64

In [15]:
pop_df = pd.DataFrame({'total': pop, 'under18':[9267089,9284094,4687374,4318033]})
pop_df

                 total  under18
cali    2000  33871648  9267089
        2010  37253956  9284094
newyork 2000  18976457  4687374
        2010  19378102  4318033

In [17]:
f_u18 = pop_df['under18']/pop_df['total']
f_u18.unstack()

             2000      2010
cali     0.273594  0.249211
newyork  0.247010  0.222831

In [18]:
"""multiIndex 생성 메서드"""
df = pd.DataFrame(np.random.rand(4,2), index=[['a','a','b','b'],[1,2,1,2]], columns=['data1','data2'])
df

        data1     data2
a 1  0.826449  0.908270
  2  0.399932  0.215086
b 1  0.104474  0.274467
  2  0.782731  0.544108

In [41]:
"""명시적 MultiIndex 생성자-배열로pd.MultiIndex.from_arrays([['a','a','b','b'],[1,2,1,2]])"""

df = pd.DataFrame(np.random.rand(4,2), index=pd.MultiIndex.from_arrays([['a','a','b','b'],[1,2,1,2]]), columns=['data1','data2'])
df

        data1     data2
a 1  0.137710  0.635727
  2  0.226610  0.743127
b 1  0.118622  0.247519
  2  0.808672  0.008873

In [42]:
"""명시적 MultiIndex 생성자-튜플로pd.MultiIndex.from_tuples([('a',1),('a',2),('b',1),('b',2)])"""
df = pd.DataFrame(np.random.rand(4,2), index=pd.MultiIndex.from_tuples([('a',1),('a',2),('b',1),('b',2)]), columns=['data1','data2'])
df

        data1     data2
a 1  0.413040  0.398754
  2  0.987259  0.023594
b 1  0.178257  0.722617
  2  0.178853  0.680590

In [22]:
""" MultiIndex 레벨 이름"""
pop.index.names=['state','year']
pop

state    year
cali     2000    33871648
         2010    37253956
newyork  2000    18976457
         2010    19378102
dtype: int64

In [43]:
"""열의 MultiIndex """
"""계층적 인덱스와 열"""
"""명시적 MultiIndex 생성자-product로 pd.MultiIndex.from_product([[2013,2014],[1,2]], names=['year','visit'])"""
index=pd.MultiIndex.from_product([[2013,2014],[1,2]], names=['year','visit'])
columns = pd.MultiIndex.from_product([['bob','guido','sue'],['hr','temp']], names=['subject', 'type'])
data=np.round(np.random.randn(4,6) ,1)
data[:, ::2] *=10
data += 37
health_data=pd.DataFrame(data, index=index , columns= columns)

health_data

subject      bob       guido         sue
type          hr  temp    hr  temp    hr  temp
year visit
2013 1      39.0  36.2  47.0  36.9  51.0  36.4
     2      39.0  36.3  37.0  36.9  46.0  35.0
2014 1      59.0  38.1  61.0  38.5  49.0  37.1
     2      37.0  38.3  34.0  37.9  43.0  36.7

In [36]:
health_data['guido']

type          hr  temp
year visit
2013 1      37.0  36.8
     2      33.0  36.3
2014 1      34.0  38.2
     2      28.0  37.8

<h3>MultiIndex 인덱싱 및 슬라이싱 154쪽</h3>

In [45]:
"""MultiIndex 인덱싱 및 슬라이싱"""
pop.index.names=['state','year']
pop

state    year
cali     2000    33871648
         2010    37253956
newyork  2000    18976457
         2010    19378102
dtype: int64

In [73]:
"""인덱싱 -단일 요소"""
pop.loc['cali',2000]

33871648

In [74]:
"""부분 인덱싱"""
pop.loc['cali']

year
2000    33871648
2010    37253956
dtype: int64

In [51]:
"""부분 슬라이싱"""
pop.loc['cali':'newyork']

state    year
cali     2000    33871648
         2010    37253956
newyork  2000    18976457
         2010    19378102
dtype: int64

In [75]:
pop.loc[:,2000]

state
cali       33871648
newyork    18976457
dtype: int64

In [76]:
"""부울 마스크를 이용"""
pop.loc[pop>22000000]

state  year
cali   2000    33871648
       2010    37253956
dtype: int64

In [77]:
"""팬시 인덱싱 이용"""
pop.loc[['cali']]

state  year
cali   2000    33871648
       2010    37253956
dtype: int64

In [55]:
"""dataframe"""
health_data

subject      bob       guido         sue
type          hr  temp    hr  temp    hr  temp
year visit
2013 1      39.0  36.2  47.0  36.9  51.0  36.4
     2      39.0  36.3  37.0  36.9  46.0  35.0
2014 1      59.0  38.1  61.0  38.5  49.0  37.1
     2      37.0  38.3  34.0  37.9  43.0  36.7

In [56]:
"""guido의 심작방동 수 데이터 가져오기"""
health_data['guido','hr']

year  visit
2013  1        47.0
      2        37.0
2014  1        61.0
      2        34.0
Name: (guido, hr), dtype: float64

In [57]:
health_data.iloc[:2,:2]

subject      bob
type          hr  temp
year visit
2013 1      39.0  36.2
     2      39.0  36.3

In [59]:
"""loc,iloc에서 개별 인덱스는 다중 인덱스의 튜플로 전달될 수 있다."""
health_data.loc[:, ('bob','hr')]

year  visit
2013  1        39.0
      2        39.0
2014  1        59.0
      2        37.0
Name: (bob, hr), dtype: float64

In [60]:
idx=pd.IndexSlice
health_data.loc[idx[:,1], idx[:,'hr']]

subject      bob guido   sue
type          hr    hr    hr
year visit
2013 1      39.0  47.0  51.0
2014 1      59.0  61.0  49.0

In [61]:
"""다중 인덱스 재정렬하기"""
"""정렬 되지 않은 다중 인덱스"""
index= pd.MultiIndex.from_product([['a','c','b'],[1,2]])
data=pd.Series(np.random.rand(6), index=index)
data.index.names=['char','int']
data

char  int
a     1      0.065802
      2      0.082310
c     1      0.905247
      2      0.397937
b     1      0.302523
      2      0.752482
dtype: float64

In [62]:
"""정렬"""
data=data.sort_index()
data

char  int
a     1      0.065802
      2      0.082310
b     1      0.302523
      2      0.752482
c     1      0.905247
      2      0.397937
dtype: float64

In [63]:
"""슬라이싱은 사전적으로 정렬된 경우 가능하다."""
data['a':'b']

char  int
a     1      0.065802
      2      0.082310
b     1      0.302523
      2      0.752482
dtype: float64

In [64]:
"""인덱스 스태킹 및 언스태킹"""
pop.unstack(level=0)

state      cali   newyork
year
2000   33871648  18976457
2010   37253956  19378102

In [65]:
pop.unstack(level=1)

year         2000      2010
state
cali     33871648  37253956
newyork  18976457  19378102

In [66]:
pop.unstack().stack()

state    year
cali     2000    33871648
         2010    37253956
newyork  2000    18976457
         2010    19378102
dtype: int64

<h3>****인덱스 설정 및 재설정</h3>
reset_index()
set_index()
sort_index()

In [81]:
"""인덱스 설정 및 재설정"""
pop_flat=pop.reset_index(name='population')
pop_flat

     state  year  population
0     cali  2000    33871648
1     cali  2010    37253956
2  newyork  2000    18976457
3  newyork  2010    19378102

In [82]:
"""다중 인덱스를 갖는 dataframe을 반환하는 dataframe의 set_index메서드"""
pop_flat.set_index(['year','state'])

              population
year state
2000 cali       33871648
2010 cali       37253956
2000 newyork    18976457
2010 newyork    19378102

In [83]:
"""dataframe 생성 함수"""
def make_df(cols, ind):
    data = {c: [str(c) + str(i) for i in ind]for  c in cols}
    return pd.DataFrame(data, ind)

In [84]:
make_df('abc', range(3))

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2

In [85]:
x=[1,2,3]
y=[4,5,6]
z=[7,8,9]
np.concatenate([x,y,z])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [86]:
x=[[1,2],[3,4]]
np.concatenate([x,x] , axis=1)

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

In [87]:
"""pd.concat"""
ser1=pd.Series(['a','b','c'] , index=[1,2,3])
ser2 = pd.Series(['d','e','f'] , index=[4,5,6])
pd.concat([ser1, ser2])

1    a
2    b
3    c
4    d
5    e
6    f
dtype: object

In [104]:
"""pd.concat"""
ser1=pd.Series(['a','b','c'] , index=[1,2,3])
ser2 = pd.Series(['d','e','f'] , index=[1,2,3])
pd.concat([ser1, ser2], axis=1)

   0  1
1  a  d
2  b  e
3  c  f

In [88]:
"""pd.concat() default axis=0(세로방향)"""
df1=make_df('ab', [1,2])
df2=make_df('ab',[3,4])

print(df1)
print(df2)
print(pd.concat([df1,df2]))

    a   b
1  a1  b1
2  a2  b2
    a   b
3  a3  b3
4  a4  b4
    a   b
1  a1  b1
2  a2  b2
3  a3  b3
4  a4  b4

In [93]:
"""pd.concat()  axis=1(가로방향)"""
df3=make_df('ab', [1,2])
df4=make_df('ab',[1,2])

print(df3)
print(df4)
print(pd.concat([df3,df4], axis=1))

    a   b
1  a1  b1
2  a2  b2
    a   b
1  a1  b1
2  a2  b2
    a   b   a   b
1  a1  b1  a1  b1
2  a2  b2  a2  b2

In [113]:
"""인덱스 복제"""
x=make_df('ab', [0,1])
y=make_df('ab',[2,3])

y.index=x.index
m=pd.concat([x,y])
print(x)
print(y)
print(pd.concat([x,y]))
print(type(m), type(m.values))

    a   b
0  a0  b0
1  a1  b1
    a   b
0  a2  b2
1  a3  b3
    a   b
0  a0  b0
1  a1  b1
0  a2  b2
1  a3  b3
<class 'pandas.core.frame.DataFrame'> <class 'numpy.ndarray'>

In [95]:
"""concat()의 결과에서 인덱스가 겹치지 않는지 검증"""
try:
    pd.concat([x,y], verify_integrity=True)
except ValueError as e:
    print("ValueError:" , e)

ValueError: Indexes have overlapping values: Index([0, 1], dtype='int64')

In [117]:
"""인덱스 자체가 중요하지 않은 경우, 인덱스를 무시한다."""
print(x)
print(y)
pd.concat([x,y]).reset_index()
print(pd.concat([x,y], ignore_index=True))

    a   b
0  a0  b0
1  a1  b1
    a   b
0  a2  b2
1  a3  b3

   index   a   b
0      0  a0  b0
1      1  a1  b1
2      0  a2  b2
3      1  a3  b3

In [98]:
"""다중 인덱스 키를 추가한다."""
print(x)
print(y)
print(pd.concat([x,y], keys=['x','y']))

    a   b
0  a0  b0
1  a1  b1
    a   b
0  a2  b2
1  a3  b3
      a   b
x 0  a0  b0
  1  a1  b1
y 0  a2  b2
  1  a3  b3

In [99]:
"""조인을 이용한 연결-default 합집합"""
df5=make_df('abc',[1,2])
df6=make_df('bcd',[3,4])
print(df5)
print(df6)
print(pd.concat([df5,df6]))

    a   b   c
1  a1  b1  c1
2  a2  b2  c2
    b   c   d
3  b3  c3  d3
4  b4  c4  d4
     a   b   c    d
1   a1  b1  c1  NaN
2   a2  b2  c2  NaN
3  NaN  b3  c3   d3
4  NaN  b4  c4   d4

In [100]:
"""조인을 이용한 연결-교집합"""
print(df5)
print(df6)
print(pd.concat([df5,df6], join='inner'))

    a   b   c
1  a1  b1  c1
2  a2  b2  c2
    b   c   d
3  b3  c3  d3
4  b4  c4  d4
    b   c
1  b1  c1
2  b2  c2
3  b3  c3
4  b4  c4

<h3>병합과 조인 merge</h3>

In [101]:
df1=pd.DataFrame({'employee':['bob','jake'], 'group':['accounting','enineering']})
df2=pd.DataFrame({'employee':['jake','bob'], 'hire_date':[2004,2008]})
print(df1)
print(df2)

  employee       group
0      bob  accounting
1     jake  enineering
  employee  hire_date
0     jake       2004
1      bob       2008

In [102]:
"""일대일 조인"""
df3=pd.merge(df1, df2)
df3

  employee       group  hire_date
0      bob  accounting       2008
1     jake  enineering       2004

In [118]:
"다대일 조인"""
df4=pd.DataFrame({'group':['accounting','enineering'],'supervisor':['carly','guido'], })
print(df3)
print(df4)
print(pd.merge(df3, df4))

  employee       group  hire_date
0      bob  accounting       2008
1     jake  enineering       2004
        group supervisor
0  accounting      carly
1  enineering      guido
  employee       group  hire_date supervisor
0      bob  accounting       2008      carly
1     jake  enineering       2004      guido

In [119]:
"""다대다 조인"""
df5=pd.DataFrame({'group':['accounting','enineering'],'skills':['math','coding']})
print(df1)
print(df5)
print(pd.merge(df1, df5))

  employee       group
0      bob  accounting
1     jake  enineering
        group  skills
0  accounting    math
1  enineering  coding
  employee       group  skills
0      bob  accounting    math
1     jake  enineering  coding

In [121]:
"""on 키워드"""
print(df1)
print(df2)
print(pd.merge(df1,df2, on='employee'))

  employee       group
0      bob  accounting
1     jake  enineering
  employee  hire_date
0     jake       2004
1      bob       2008
  employee       group  hire_date
0      bob  accounting       2008
1     jake  enineering       2004

In [122]:
"""left_on, right_on"""
df3=pd.DataFrame({'name':['bob','jake'], 'salary':[7000,8000]})
print(df1) 
print(df3)
print(pd.merge(df1,df3, left_on='employee' , right_on='name'))

  employee       group
0      bob  accounting
1     jake  enineering
   name  salary
0   bob    7000
1  jake    8000
  employee       group  name  salary
0      bob  accounting   bob    7000
1     jake  enineering  jake    8000

In [123]:
print(pd.merge(df1,df3, left_on='employee' , right_on='name').drop('name', axis=1))

  employee       group  salary
0      bob  accounting    7000
1     jake  enineering    8000

In [127]:
"""인덱스 병합 :left_index, right_index"""
df1a=df1.set_index('employee')
df2a=df2.set_index('employee')
print(df1a)
print(df2a)
print(pd.merge(df1a, df2a, left_index=True, right_index=True))

               group
employee
bob       accounting
jake      enineering
          hire_date
employee
jake           2004
bob            2008
               group  hire_date
employee
bob       accounting       2008
jake      enineering       2004

In [131]:
print(df1a.join(df2a))

               group  hire_date
employee
bob       accounting       2008
jake      enineering       2004

In [132]:
"""suffixes 키워드"""
"""두개의 입력 dataframe이 충돌하는 열 이름을 가진 경우-자동으로 접미사_x, _y가 붙는다."""
df8=pd.DataFrame({'name':['bob','jake'],'rank':[1,2]})
df9=pd.DataFrame({'name':['bob','jake'],'rank':[3,1]})
print(df8)
print(df9)
print(pd.merge(df8, df9, on='name'))

   name  rank
0   bob     1
1  jake     2
   name  rank
0   bob     3
1  jake     1
   name  rank_x  rank_y
0   bob       1       3
1  jake       2       1

In [133]:
print(pd.merge(df8, df9, on='name', suffixes=["_L","_R"]))

   name  rank_L  rank_R
0   bob       1       3
1  jake       2       1

<h3>예제:미국 주 데이터 178쪽</h3>

In [156]:
pop=pd.read_csv('data/state-population.csv')
areas=pd.read_csv('https://raw.githubusercontent.com/jakevdp/PythonDataScienceHandbook/master/notebooks/data/state-areas.csv')
abbrevs=pd.read_csv('https://raw.githubusercontent.com/jakevdp/PythonDataScienceHandbook/master/notebooks/data/state-abbrevs.csv')

In [157]:
pop.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2544 entries, 0 to 2543
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   state       2544 non-null   object
 1   ages        2544 non-null   object
 2   year        2544 non-null   int64
 3   population  2524 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 79.6+ KB

In [158]:
areas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   state          52 non-null     object
 1   area (sq. mi)  52 non-null     int64
dtypes: int64(1), object(1)
memory usage: 960.0+ bytes

In [159]:
abbrevs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   state         51 non-null     object
 1   abbreviation  51 non-null     object
dtypes: object(2)
memory usage: 944.0+ bytes

In [186]:
print(pop.shape)
print(areas.shape)
print(abbrevs.shape)

(2544, 4)
(52, 2)
(51, 2)

In [160]:
print(abbrevs.head())
print(areas.head())

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [169]:
print(abbrevs.shape)
print(areas.shape)

(51, 2)
(52, 2)

In [170]:
"""abbrevs, areas 데이터 합집합"""
merge_df=pd.merge(abbrevs, areas, how="outer")
merge_df.shape

(52, 3)

In [171]:
"""abbrevs 기준"""
merge_df=pd.merge(abbrevs, areas, how="left")
merge_df.shape

(51, 3)

In [172]:
"""areas 기준"""
merge_df=pd.merge(abbrevs, areas, how="right")
merge_df.shape

(52, 3)

In [174]:
pop.head()

  state     ages  year  population
0    AL  under18  2012   1117489.0
1    AL    total  2012   4817528.0
2    AL  under18  2010   1130966.0
3    AL    total  2010   4785570.0
4    AL  under18  2011   1125763.0

In [185]:
"""pop 데이터의 state 컬럼과 merge_df의 abbreviation컬럼의 조인"""
pd.merge(pop, merge_df, how="outer", left_on='state/region' , right_on='abbreviation')

,state/region,ages,year,population,state,abbreviation,area (sq. mi)
0,AK,total,1990.0,553290.0,Alaska,AK,656425.0
1,AK,under18,1990.0,177502.0,Alaska,AK,656425.0
2,AK,total,1992.0,588736.0,Alaska,AK,656425.0
3,AK,under18,1991.0,182180.0,Alaska,AK,656425.0
4,AK,under18,1992.0,184878.0,Alaska,AK,656425.0
...,...,...,...,...,...,...,...
2540,WY,total,1991.0,459260.0,Wyoming,WY,97818.0
2541,WY,under18,1991.0,136720.0,Wyoming,WY,97818.0
2542,WY,under18,1990.0,136078.0,Wyoming,WY,97818.0
2543,WY,total,1990.0,453690.0,Wyoming,WY,97818.0
2544,NaN,NaN,NaN,NaN,Puerto Rico,NaN,3515.0

In [182]:
"""pop 컬럼명 바꾸기"""
pop = pop.rename(columns={'state': 'state/region'})
pop.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

In [188]:
pop[pop.isna( ).any(axis=1)]

     state/region     ages  year  population
2448           PR  under18  1990         NaN
2449           PR    total  1990         NaN
2450           PR    total  1991         NaN
2451           PR  under18  1991         NaN
2452           PR    total  1993         NaN
2453           PR  under18  1993         NaN
2454           PR  under18  1992         NaN
2455           PR    total  1992         NaN
2456           PR  under18  1994         NaN
2457           PR    total  1994         NaN
2458           PR    total  1995         NaN
2459           PR  under18  1995         NaN
2460           PR  under18  1996         NaN
2461           PR    total  1996         NaN
2462           PR  under18  1998         NaN
2463           PR    total  1998         NaN
2464           PR    total  1997         NaN
2465           PR  under18  1997         NaN
2466           PR    total  1999         NaN
2467           PR  under18  1999         NaN

In [190]:
merge_df[merge_df.isna( ).any(axis=1)]

          state abbreviation  area (sq. mi)
51  Puerto Rico          NaN           3515

<h3>groupby</h3>

In [191]:
pip install seaborn

Collecting seaborn
  Downloading seaborn-0.13.2-py3-none-any.whl.metadata (5.4 kB)
Requirement already satisfied: numpy!=1.24.0,>=1.20 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from seaborn) (1.26.4)
Requirement already satisfied: pandas>=1.2 in c:\users\user\appdata\roaming\python\python39\site-packages (from seaborn) (2.2.2)
Requirement already satisfied: matplotlib!=3.6.1,>=3.4 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from seaborn) (3.9.0)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.2.1)
Requirement already satisfied: cycler>=0.10 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (4.51.0)
Requirement already satisfied: kiwisolver>=1.3.1 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.4.5)
Requirement already satisfied: packaging>=20.0 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (24.0)
Requirement already satisfied: pillow>=8 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (10.3.0)
Requirement already satisfied: pyparsing>=2.3.1 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (3.1.2)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (2.9.0.post0)
Requirement already satisfied: importlib-resources>=3.2.0 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (6.4.0)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\appdata\roaming\python\python39\site-packages (from pandas>=1.2->seaborn) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\user\appdata\roaming\python\python39\site-packages (from pandas>=1.2->seaborn) (2024.1)
Requirement already satisfied: zipp>=3.1.0 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from importlib-resources>=3.2.0->matplotlib!=3.6.1,>=3.4->seaborn) (3.18.2)
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.4->seaborn) (1.16.0)
Downloading seaborn-0.13.2-py3-none-any.whl (294 kB)
   ---------------------------------------- 0.0/294.9 kB ? eta -:--:--
   ----------- ---------------------------- 81.9/294.9 kB 2.3 MB/s eta 0:00:01
   -------------------------- ------------- 194.6/294.9 kB 2.4 MB/s eta 0:00:01
   ---------------------------------------- 294.9/294.9 kB 2.3 MB/s eta 0:00:00
Installing collected packages: seaborn
Successfully installed seaborn-0.13.2
Note: you may need to restart the kernel to use updated packages.

In [192]:
import seaborn as sns

In [207]:
df = sns.load_dataset('planets')
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [208]:
df.groupby('method')

In [209]:
df.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [214]:
df.groupby('method').aggregate({'orbital_period':'min','year':'max'})

                               orbital_period  year
method
Astrometry                         246.360000  2013
Eclipse Timing Variations         1916.250000  2012
Imaging                           4639.150000  2013
Microlensing                      1825.000000  2013
Orbital Brightness Modulation        0.240104  2013
Pulsar Timing                        0.090706  2011
Pulsation Timing Variations       1170.000000  2007
Radial Velocity                      0.736540  2014
Transit                              0.355000  2014
Transit Timing Variations           22.339500  2014

In [198]:
for (method, group) in df.groupby('method'):
    print("{0:30s} shape={1}".format(method, group.shape))

Astrometry                     shape=(2, 6)
Eclipse Timing Variations      shape=(9, 6)
Imaging                        shape=(38, 6)
Microlensing                   shape=(23, 6)
Orbital Brightness Modulation  shape=(3, 6)
Pulsar Timing                  shape=(5, 6)
Pulsation Timing Variations    shape=(1, 6)
Radial Velocity                shape=(553, 6)
Transit                        shape=(397, 6)
Transit Timing Variations      shape=(4, 6)

In [201]:
df.groupby('method')['year'].describe().unstack()

       method
count  Astrometry                          2.0
       Eclipse Timing Variations           9.0
       Imaging                            38.0
       Microlensing                       23.0
       Orbital Brightness Modulation       3.0
                                         ...
max    Pulsar Timing                    2011.0
       Pulsation Timing Variations      2007.0
       Radial Velocity                  2014.0
       Transit                          2014.0
       Transit Timing Variations        2014.0
Length: 80, dtype: float64

In [203]:
"""집계, 필터, 변환, 적용"""
"""aggregate()"""
rng=np.random.RandomState(0)
df=pd.DataFrame({'key':['a','b','c','a'], 'data1':range(4), 'data2':rng.randint(0,10,4)}, columns=['key','data1','data2'])
df

  key  data1  data2
0   a      0      5
1   b      1      0
2   c      2      3
3   a      3      3

In [204]:
df.groupby('key').aggregate([min,np.median, max])

C:\Users\user\AppData\Local\Temp\ipykernel_9896\587878445.py:1: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df.groupby('key').aggregate([min,np.median, max])
C:\Users\user\AppData\Local\Temp\ipykernel_9896\587878445.py:1: FutureWarning: The provided callable <function median at 0x000001E04F100DC0> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  df.groupby('key').aggregate([min,np.median, max])
C:\Users\user\AppData\Local\Temp\ipykernel_9896\587878445.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df.groupby('key').aggregate([min,np.median, max])
C:\Users\user\AppData\Local\Temp\ipykernel_9896\587878445.py:1: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df.groupby('key').aggregate([min,np.median, max])

    data1            data2
      min median max   min median max
key
a       0    1.5   3     3    4.0   5
b       1    1.0   1     0    0.0   0
c       2    2.0   2     3    3.0   3

In [205]:
df.groupby('key').aggregate({'data1':'min','data2':'max'})

     data1  data2
key
a        0      5
b        1      0
c        2      3